espressif/esp-idf/components/soc/esp32s31/register/soc/ledc_struct.h
/** Type of conf register
 *  LEDC global configuration register
 */
typedef union {
    struct {
        uint32_t reserved_0:2;
        /** gamma_ram_clk_en_ch0 : R/W; bitpos: [2]; default: 0;
         *  Configures whether or not to open LEDC ch0 gamma ram clock gate.
         *  0: Open the clock gate only when application writes or reads LEDC ch0 gamma ram
         *  1: Force open the clock gate for LEDC ch0 gamma ram
         */
        uint32_t gamma_ram_clk_en_ch0:1;
        /** gamma_ram_clk_en_ch1 : R/W; bitpos: [3]; default: 0;
         *  Configures whether or not to open LEDC ch1 gamma ram clock gate.
         *  0: Open the clock gate only when application writes or reads LEDC ch1 gamma ram
         *  1: Force open the clock gate for LEDC ch1 gamma ram
         */
        uint32_t gamma_ram_clk_en_ch1:1;
        /** gamma_ram_clk_en_ch2 : R/W; bitpos: [4]; default: 0;
         *  Configures whether or not to open LEDC ch2 gamma ram clock gate.
         *  0: Open the clock gate only when application writes or reads LEDC ch2 gamma ram
         *  1: Force open the clock gate for LEDC ch2 gamma ram
         */
        uint32_t gamma_ram_clk_en_ch2:1;
        /** gamma_ram_clk_en_ch3 : R/W; bitpos: [5]; default: 0;
         *  Configures whether or not to open LEDC ch3 gamma ram clock gate.
         *  0: Open the clock gate only when application writes or reads LEDC ch3 gamma ram
         *  1: Force open the clock gate for LEDC ch3 gamma ram
         */
        uint32_t gamma_ram_clk_en_ch3:1;
        /** gamma_ram_clk_en_ch4 : R/W; bitpos: [6]; default: 0;
         *  Configures whether or not to open LEDC ch4 gamma ram clock gate.
         *  0: Open the clock gate only when application writes or reads LEDC ch4 gamma ram
         *  1: Force open the clock gate for LEDC ch4 gamma ram
         */
        uint32_t gamma_ram_clk_en_ch4:1;
        /** gamma_ram_clk_en_ch5 : R/W; bitpos: [7]; default: 0;
         *  Configures whether or not to open LEDC ch5 gamma ram clock gate.
         *  0: Open the clock gate only when application writes or reads LEDC ch5 gamma ram
         *  1: Force open the clock gate for LEDC ch5 gamma ram
         */
        uint32_t gamma_ram_clk_en_ch5:1;
        /** gamma_ram_clk_en_ch6 : R/W; bitpos: [8]; default: 0;
         *  Configures whether or not to open LEDC ch6 gamma ram clock gate.
         *  0: Open the clock gate only when application writes or reads LEDC ch6 gamma ram
         *  1: Force open the clock gate for LEDC ch6 gamma ram
         */
        uint32_t gamma_ram_clk_en_ch6:1;
        /** gamma_ram_clk_en_ch7 : R/W; bitpos: [9]; default: 0;
         *  Configures whether or not to open LEDC ch7 gamma ram clock gate.
         *  0: Open the clock gate only when application writes or reads LEDC ch7 gamma ram
         *  1: Force open the clock gate for LEDC ch7 gamma ram
         */
        uint32_t gamma_ram_clk_en_ch7:1;
        uint32_t reserved_10:21;
        /** clk_en : R/W; bitpos: [31]; default: 0;
         *  Configures whether or not to open register clock gate.
         *  0: Open the clock gate only when application writes registers
         *  1: Force open the clock gate for register
         */
        uint32_t clk_en:1;
    };
    uint32_t val;
} ledc_conf_reg_t;

/** Type of ch_power_up_conf register
 *  LEDC channel power up configuration register
 */
typedef union {
    struct {
        /** ch0_power_up : R/W; bitpos: [0]; default: 0;
         *  Configures whether or not to power up ch0.
         *  0: power down
         *  1: power up
         */
        uint32_t ch0_power_up:1;
        /** ch1_power_up : R/W; bitpos: [1]; default: 0;
         *  Configures whether or not to power up ch1.
         *  0: power down
         *  1: power up
         */
        uint32_t ch1_power_up:1;
        /** ch2_power_up : R/W; bitpos: [2]; default: 0;
         *  Configures whether or not to power up ch2.
         *  0: power down
         *  1: power up
         */
        uint32_t ch2_power_up:1;
        /** ch3_power_up : R/W; bitpos: [3]; default: 0;
         *  Configures whether or not to power up ch3.
         *  0: power down
         *  1: power up
         */
        uint32_t ch3_power_up:1;
        /** ch4_power_up : R/W; bitpos: [4]; default: 0;
         *  Configures whether or not to power up ch4.
         *  0: power down
         *  1: power up
         */
        uint32_t ch4_power_up:1;
        /** ch5_power_up : R/W; bitpos: [5]; default: 0;
         *  Configures whether or not to power up ch5.
         *  0: power down
         *  1: power up
         */
        uint32_t ch5_power_up:1;
        /** ch6_power_up : R/W; bitpos: [6]; default: 0;
         *  Configures whether or not to power up ch6.
         *  0: power down
         *  1: power up
         */
        uint32_t ch6_power_up:1;
        /** ch7_power_up : R/W; bitpos: [7]; default: 0;
         *  Configures whether or not to power up ch7.
         *  0: power down
         *  1: power up
         */
        uint32_t ch7_power_up:1;
        /** ch0_clk_gate_force_on : R/W; bitpos: [8]; default: 0;
         *  Configures whether or not to open ch0 clock gate.
         *  0: Open the clock gate only when ch0 is power up
         *  1: Force open the clock gate for ch0
         */
        uint32_t ch0_clk_gate_force_on:1;
        /** ch1_clk_gate_force_on : R/W; bitpos: [9]; default: 0;
         *  Configures whether or not to open ch1 clock gate.
         *  0: Open the clock gate only when ch1 is power up
         *  1: Force open the clock gate for ch1
         */
        uint32_t ch1_clk_gate_force_on:1;
        /** ch2_clk_gate_force_on : R/W; bitpos: [10]; default: 0;
         *  Configures whether or not to open ch2 clock gate.
         *  0: Open the clock gate only when ch2 is power up
         *  1: Force open the clock gate for ch2
         */
        uint32_t ch2_clk_gate_force_on:1;
        /** ch3_clk_gate_force_on : R/W; bitpos: [11]; default: 0;
         *  Configures whether or not to open ch3 clock gate.
         *  0: Open the clock gate only when ch3 is power up
         *  1: Force open the clock gate for ch3
         */
        uint32_t ch3_clk_gate_force_on:1;
        /** ch4_clk_gate_force_on : R/W; bitpos: [12]; default: 0;
         *  Configures whether or not to open ch4 clock gate.
         *  0: Open the clock gate only when ch4 is power up
         *  1: Force open the clock gate for ch4
         */
        uint32_t ch4_clk_gate_force_on:1;
        /** ch5_clk_gate_force_on : R/W; bitpos: [13]; default: 0;
         *  Configures whether or not to open ch5 clock gate.
         *  0: Open the clock gate only when ch5 is power up
         *  1: Force open the clock gate for ch5
         */
        uint32_t ch5_clk_gate_force_on:1;
        /** ch6_clk_gate_force_on : R/W; bitpos: [14]; default: 0;
         *  Configures whether or not to open ch6 clock gate.
         *  0: Open the clock gate only when ch6 is power up
         *  1: Force open the clock gate for ch6
         */
        uint32_t ch6_clk_gate_force_on:1;
        /** ch7_clk_gate_force_on : R/W; bitpos: [15]; default: 0;
         *  Configures whether or not to open ch7 clock gate.
         *  0: Open the clock gate only when ch7 is power up
         *  1: Force open the clock gate for ch7
         */
        uint32_t ch7_clk_gate_force_on:1;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} ledc_ch_power_up_conf_reg_t;

/** Type of timer_power_up_conf register
 *  LEDC timer power up configuration register
 */
typedef union {
    struct {
        /** timer0_power_up : R/W; bitpos: [0]; default: 0;
         *  Configures whether or not to power up timer0.
         *  0: power down
         *  1: power up
         */
        uint32_t timer0_power_up:1;
        /** timer1_power_up : R/W; bitpos: [1]; default: 0;
         *  Configures whether or not to power up timer1.
         *  0: power down
         *  1: power up
         */
        uint32_t timer1_power_up:1;
        /** timer2_power_up : R/W; bitpos: [2]; default: 0;
         *  Configures whether or not to power up timer2.
         *  0: power down
         *  1: power up
         */
        uint32_t timer2_power_up:1;
        /** timer3_power_up : R/W; bitpos: [3]; default: 0;
         *  Configures whether or not to power up timer3.
         *  0: power down
         *  1: power up
         */
        uint32_t timer3_power_up:1;
        /** timer0_clk_gate_force_on : R/W; bitpos: [4]; default: 0;
         *  Configures whether or not to open timer0 clock gate.
         *  0: Open the clock gate only when timer0 is power up
         *  1: Force open the clock gate for timer0
         */
        uint32_t timer0_clk_gate_force_on:1;
        /** timer1_clk_gate_force_on : R/W; bitpos: [5]; default: 0;
         *  Configures whether or not to open timer1 clock gate.
         *  0: Open the clock gate only when timer1 is power up
         *  1: Force open the clock gate for timer1
         */
        uint32_t timer1_clk_gate_force_on:1;
        /** timer2_clk_gate_force_on : R/W; bitpos: [6]; default: 0;
         *  Configures whether or not to open timer2 clock gate.
         *  0: Open the clock gate only when timer2 is power up
         *  1: Force open the clock gate for timer2
         */
        uint32_t timer2_clk_gate_force_on:1;
        /** timer3_clk_gate_force_on : R/W; bitpos: [7]; default: 0;
         *  Configures whether or not to open timer3 clock gate.
         *  0: Open the clock gate only when timer3 is power up
         *  1: Force open the clock gate for timer3
         */
        uint32_t timer3_clk_gate_force_on:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} ledc_timer_power_up_conf_reg_t;


